***********************************************************************
***                      © 3corações                                ***
***********************************************************************
***                                                                   *
*** DESCRIÇÃO: JOB Importação arquivos bancários VAN FINNET           *
*** AUTOR : Anderson Miazato - META                                   *
*** FUNCIONAL: Raphael Rocha - META                                   *
*** DATA : 15.10.2021                                                 *
***********************************************************************
*** HISTÓRICO DAS MODIFICAÇÕES                                        *
***-------------------------------------------------------------------*
*** DATA       | AUTOR              | DESCRIÇÃO                       *
***-------------------------------------------------------------------*
*** 15.10.2021 | Anderson Miazato   | Desenvolvimento inicial         *
***********************************************************************

*&---------------------------------------------------------------------*
*& Report zfir_autbanc_import
*&---------------------------------------------------------------------*
*&
*&---------------------------------------------------------------------*
REPORT zfir_autbanc_import.

START-OF-SELECTION.

  "Lógica do processamento de arquivos bancários.
  zclfi_autobanc_import=>create_instance( )->main( ).
